ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ecap_signal_monitoring_regs.xml
<module id="ECAP_SIGNAL_MONITORING" HW_revision="" description="ECAP SIGNAL MONITORING Registers">
	<register id="MUNIT_COMMON_CTL" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Control registers for monitoring unit {#}">
		<bitfield id="TRIPSEL" description="Trip signal select " begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="GLDSTRBSEL" description="Global Load strobe select" begin="14" end="8" width="7" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_CTL" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Control registers for monitoring unit 1">
		<bitfield id="EN" description="Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DEBUG_RANGE_EN" description="Debug enable to aquire the range of check being done" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DISABLE_EARLY_MAX_ERR" description="Disable early max error check" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MON_SEL" description="Selects type of monitoring " begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_SHADOW_CTL" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Shadow control registers for monitoring unit 1">
		<bitfield id="SYNCI_EN" description="Enable for shadowing on Min and Max Registers" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="SW sync to copy shadow to active Min and Max registers " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOADMODE" description="Load mode" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_MIN" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="Min value for monitoring unit 1">
		<bitfield id="MIN_VALUE" description="Mimum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_MAX" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Max value for monitoring unit 1">
		<bitfield id="MAX_VALUE" description="Maximum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_MIN_SHADOW" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Shadow register for Min value of monitoring unit 1">
		<bitfield id="MIN_VALUE_SHADOW" description="Shadow Mimum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_MAX_SHADOW" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="Shadow register for Max value of monitoring unit 1">
		<bitfield id="MAX_VALUE_SHADOW" description="Shadow Maximum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_1_DEBUG_RANGE_MIN" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="Observed Min value of check being enabled on minotoring unit 1">
		<bitfield id="MIN_VALUE" description="Observed min value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MUNIT_1_DEBUG_RANGE_MAX" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Observed Max value of check being enabled on minotoring unit 1">
		<bitfield id="MAX_VALUE" description="Observed max value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MUNIT_2_CTL" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Control registers for monitoring unit 2">
		<bitfield id="EN" description="Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DEBUG_RANGE_EN" description="Debug enable to aquire the range of check being done" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DISABLE_EARLY_MAX_ERR" description="Disable early max error check" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MON_SEL" description="Selects type of monitoring " begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_SHADOW_CTL" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Shadow control registers for monitoring unit 2">
		<bitfield id="SYNCI_EN" description="Enable for shadowing on Min and Max Registers" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="SW sync to copy shadow to active Min and Max registers " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOADMODE" description="Load mode" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_MIN" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Min value for monitoring unit 2">
		<bitfield id="MIN_VALUE" description="Mimum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_MAX" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Max value for monitoring unit 2">
		<bitfield id="MAX_VALUE" description="Maximum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_MIN_SHADOW" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Shadow register for Min value of monitoring unit 2">
		<bitfield id="MIN_VALUE_SHADOW" description="Shadow Mimum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_MAX_SHADOW" width="32" page="0" offset="0x9c" instances="1" instaddr="4" internal="0" description="Shadow register for Max value of monitoring unit 2">
		<bitfield id="MAX_VALUE_SHADOW" description="Shadow Maximum value for monitoring " begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MUNIT_2_DEBUG_RANGE_MIN" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="Observed Min value of check being enabled on minotoring unit 2">
		<bitfield id="MIN_VALUE" description="Observed min value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MUNIT_2_DEBUG_RANGE_MAX" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="Observed Max value of check being enabled on minotoring unit 2">
		<bitfield id="MAX_VALUE" description="Observed max value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
